export enum ErrorTitlesEnum {
  PageNotFound = 'Страница недоступна или не реализована',
  FileMaxSizeError = 'К сожалению, выбранный файл превышает допустимый (не более 50 Мб) объем вложений. Попробуйте выбрать другой',

  AdFileMaxSizeError = 'Уменьшите размер и попробуйте снова',
  AdFileMaxSizeErrorDescription = 'Попробуйте заменить файл на другой или попробуйте ещё раз',

  AdFileMaxCountError = 'Доступна загрузка не более 10 файлов',
  AdFileMaxCountErrorDescription = 'Удалите лишние файлы',

  AdFileFormatError = 'Недопустимый формат файла',
  AdFileFormatErrorDescription = 'Загрузить другой файл правильного формата или попробуйте заменить формат у этого вручную',

  FileFormatError = 'К сожалению, выбранный файл содержит неправильный формат. Попробуйте выбрать другой',

  InvalidExpression = 'Ваше сообщение содержит некорректное выражение. Пожалуйста, переформулируйте сообщение.',
}
